{
  "Job ID": 602875,
  "Agency": "DEPT OF ENVIRONMENT PROTECTION",
  "Posting Type": "Internal",
  "# Of Positions": 1,
  "Business Title": "Cost Estimator",
  "Civil Service Title": "ASSISTANT CIVIL ENGINEER",
  "Title Classification": "Competitive-1",
  "Title Code No": "20210",
  "Level": "00",
  "Job Category": "Engineering, Architecture, & Planning Policy, Research & Analysis",
  "Full-Time/Part-Time indicator": "F",
  "Career Level": "Experienced (non-manager)",
  "Salary Range From": 62370.0,
  "Salary Range To": 93587.0,
  "Salary Frequency": "Annual",
  "Work Location": "59-17 Junction Blvd Corona Ny",
  "Division/Work Unit": "Green Infrastructure",
  "Job Description": "The NYC Department of Environmental Protection (DEP) protects public health and the environment by supplying clean drinking water, collecting and treating wastewater, and reducing air, noise, and hazardous materials pollution. DEP is the largest combined municipal water and wastewater utility in the country, with nearly 6,000 employees. We deliver 1.1 billion gallons of high-quality drinking water per day to 8.3 million New York City residents and more than 1 million people in Upstate New York, and we collect and treat an average of 1.3 billion gallons of wastewater per day. The Bureau of Environmental Planning and Analysis (BEPA) is responsible for conducting environmental reviews for DEP in accordance with all applicable City Environmental Quality Review (CEQR) and State Environmental Quality Review (SEQR) regulations. In addition, this office provides technical assistance to other City agencies especially in the areas of air and noise quality and hazardous materials. The Office also provides technical assistance for the preservation of natural resources (wetlands remediation and development of natural landscaping plans) and conducts long range planning (population/employment, consumption and demand/flow) for the agency. The Bureau also conducts strategic planning to help ensure appropriate forecasting, trend analysis, regulatory review, scientific modeling, and research. In particular, the Bureau oversees the development of a watershed/sewer shed protection plan for Jamaica Bay, is continuing the work of the climate change task force and helps DEP plan for the new growth stimulated by rezoning throughout the city.  The In-House Design team at BEPA specializes in delivering cutting-edge civil engineering design solutions to support the green infrastructure (GI) vision of the New York City Department of Environmental Protection (NYC-DEP). Our Engineering team is dedicated to designing and implementing large-scale green infrastructure (GI) projects that prioritize the capture of substantial volumes of stormwater annually to eliminate or remove mass pollutants, reduce CSO events, and mitigate the impact of extreme weather flooding. The BEPA In-House Design team is responsible for identifying and evaluating different large-scale green infrastructure (GI) and low-impact development (LID) practices, as well as exploring potential financing mechanisms to support these initiatives. The IHD team collaborates with various stakeholders, including the Department of Transportation (DOT) and the Department of Parks and Recreation (DPR), the New York State Department of Environmental Conservation (DEC) to establish partnerships and effectively achieve these objectives.  The Bureau is seeking to hire a skilled Cost Estimator under direct supervision of the In-House Design Director, with little latitude for independent judgment, to perform the following duties:  •\tEngineering quantities and cost estimation works such as, skillfully computing comprehensive construction project quantities and costs, including labor, materials, and equipment.  •       Evaluate bid specifications and drawings, ensuring a thorough understanding of contract documents to optimize the cost estimation process. •       Collaborate with Project Management to review and enhance project schedules, including cost breakdowns. •       Innovatively propose cost-saving solutions to the IHD Project Management team, contributing valuable perspectives beyond the CIP design and construction phases.  Additional critical tasks include CAD drafting, construction inspection, public agency interaction, and contractor document preparation.",
  "Minimum Qual Requirements": "1.  A baccalaureate degree from an accredited college in civil engineering and one year of full-time satisfactory experience in civil engineering work; or  2.  A baccalaureate degree from an accredited college and a Master's degree from an accredited college in civil engineering.",
  "Preferred Skills": "•      Experience in the application of code requirements and preparation of civil engineering construction documents such as site plans, Site grading, earthworks, sediment/erosion control design,         utility plan/profile design, reports and analyses, specifications, cost estimates, and technical reports. •      Experience in analyzing construction drawings, sections, profiles, and details to determine engineering quantities and costs, including materials, labor, and other related costs for surface and         subsurface drainage projects. •      Experience in preparing engineering cost estimates for purposes of budget planning, scheduling work, and organizing. •      Work with project managers to ensure accurate cost estimates and prepare cost reports for submission to management. •      Supports the development, preparation, and maintenance of In-House Design (IHD) procedures on cost estimating, incorporating current best practices used in the construction, Drainage, and         transportation industries.  •      Experience in analyzing and assessing project risks and developing strategies to minimize costs. •      Ability to review the contractor’s Application for payment and supporting documents.  •      Stay up to date with industry trends and maintain technical expertise by reviewing professional publications and engaging with professional networks.  •      Must have AutoCAD Civil 3D experience. •      Must have Strong written and oral communication skills, computer skills, and the ability to organize and analyze data  •      Ability to work well in a team-oriented environment and with the public.",
  "Additional Information": "DEP is an equal opportunity employer with a strong commitment to the diversity of our organization and workforce. Your voluntary response to the NYCAPS on-line application section for referral information will assist us tremendously in our ability to track the success of our outreach and recruitment efforts. Please be sure to indicate your source of referral to this job.",
  "To Apply": "To apply click Apply Now.",
  "Hours/Shift": 0,
  "Work Location 1": "59-17 Junction Blvd Corona NY",
  "Recruitment Contact": 0.0,
  "Residency Requirement": "New York City Residency is not required for this position",
  "Posting Date": "10/06/2023",
  "Post Until": 0,
  "Posting Updated": "10/06/2023",
  "Process Date": "11/20/2023"
}