{"0": {"title": "Business Operations Analyst", "company": "Administration & Human Resources Technology, Data & Innovation Policy, Research & Analysis", "qualification": "1. A master’s degree from an accredited college or university, accredited by regional, national, professional or specialized agencies recognized as accrediting bodies by the U.S. Secretary of Education and the Council for Higher Education Accreditation (CHEA) in economics, finance, accounting, business or public administration, human resources management, management science, operations research, organizational behavior, industrial psychology, statistics, personnel administration, labor relations, psychology, sociology, human resources development, political science, urban studies or a closely related field, and one year of satisfactory full-time professional experience in one or a combination of the following: working with the budget of a large public or private concern in budget administration, accounting, economic or financial administration, or fiscal or economic research; or in management or methods analysis, operations research, organizational research or program evaluation; or in personnel or public administration, recruitment, position classification, personnel relations, labor relations, employee   benefits, staff development, employment program planning/administration, labor market research, economic planning, social services program planning/evaluation, or fiscal management; or in a related area; or  2. A baccalaureate degree from an accredited college or university, accredited by regional, national, professional or specialized agencies recognized as accrediting bodies by the U.S. Secretary of Education and the Council for Higher Education Accreditation (CHEA) and three years of satisfactory full-time professional experience in the areas described in  E above."}, "1": {"title": "Executive Program Manager", "qualification": "At least six years of full-time satisfactory experience in construction management work on capital projects, each one of which must have had a dollar value of at least $15,000, at least eighteen months of which must have been in a managerial or consultative capacity in an organization responsible for the management of construction; and a combination of the following, sufficient to equal a total of ten years of education and experience:  a. Full-time satisfactory experience in construction inspection on capital projects, each one of which must have had a dollar value of at least $15,000. One year of acceptable experience will be credited for each year of construction inspection experience up to a maximum of four years.  b. Full-time satisfactory experience in building construction as a journeyperson in one or more of the skilled building construction trades. One year of acceptable experience will be credited for each year of journeyperson experience up to a maximum of four years.  c. Education in an accredited college leading to a bachelor's degree in architecture, landscape architecture, or air pollution control, chemical, civil including structural and bridge design, electrical, mechanical, or sanitary engineering will be credited on the basis of 30 credits for one year of acceptable experience up to a maximum of four years.  A New York State license as a professional engineer or registered architect or a license as a professional engineer or registered architect from a state that has reciprocity with New York State may be substituted for the four years of education and experience described in a, b and c above. However, all candidates must have at least six years of experience in construction management work described above, including at least eighteen months in a managerial or consultative capacity in an organization responsible for the management of construction.    License Requirements  Possession of a Motor Vehicle Driver License valid in the State of New York. Employees must maintain the license during their employment.", "company": "Communications & Intergovernmental Affairs Engineering, Architecture, & Planning"}, "2": {"title": "Analyst  Energy Efficiency and Modernization", "qualification": "1. A baccalaureate degree from an accredited college.", "company": "Finance, Accounting, & Procurement Policy, Research & Analysis"}}